In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)

In [5]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [7]:
df

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [8]:
df2 = pd.DataFrame(
   ...:     {
   ...:         "A": 1.0,
   ...:         "B": pd.Timestamp("20130102"),
   ...:         "C": pd.Series(1, index=list(range(4)), dtype="float32"),
   ...:         "D": np.array([3] * 4, dtype="int32"),
   ...:         "E": pd.Categorical(["test", "train", "test", "train"]),
   ...:         "F": "foo",
   ...:     }
   ...: )
   ...:

In [9]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [10]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [25]:
# df2.<TAB>

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285

In [13]:
df.tail(2)

                   A         B         C         D
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[ 0.03425545, -0.64914572,  0.66751867,  0.47902972],
       [-1.03661973, -0.54771724, -0.67880876, -0.91739001],
       [-0.74849938, -1.16270562,  1.74633914,  0.00323905],
       [ 1.10167066,  0.11010578, -1.44921113,  0.23597671],
       [ 0.14467197,  0.2087888 , -0.38130847,  0.83328501],
       [ 0.56762291,  0.74200401,  0.07518625, -1.62685346]])

In [17]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [18]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.010517 -0.216445 -0.003381 -0.165452
std    0.799018  0.692599  1.114204  0.927743
min   -1.036620 -1.162706 -1.449211 -1.626853
25%   -0.552811 -0.623789 -0.604434 -0.687233
50%    0.089464 -0.218806 -0.153061  0.119608
75%    0.461885  0.184118  0.519436  0.418266
max    1.101671  0.742004  1.746339  0.833285

In [19]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.034255   -1.036620   -0.748499    1.101671    0.144672    0.567623
B   -0.649146   -0.547717   -1.162706    0.110106    0.208789    0.742004
C    0.667519   -0.678809    1.746339   -1.449211   -0.381308    0.075186
D    0.479030   -0.917390    0.003239    0.235977    0.833285   -1.626853

In [20]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.479030  0.667519 -0.649146  0.034255
2013-01-02 -0.917390 -0.678809 -0.547717 -1.036620
2013-01-03  0.003239  1.746339 -1.162706 -0.748499
2013-01-04  0.235977 -1.449211  0.110106  1.101671
2013-01-05  0.833285 -0.381308  0.208789  0.144672
2013-01-06 -1.626853  0.075186  0.742004  0.567623

In [21]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.479030  0.667519 -0.649146  0.034255
2013-01-02 -0.917390 -0.678809 -0.547717 -1.036620
2013-01-03  0.003239  1.746339 -1.162706 -0.748499
2013-01-04  0.235977 -1.449211  0.110106  1.101671
2013-01-05  0.833285 -0.381308  0.208789  0.144672
2013-01-06 -1.626853  0.075186  0.742004  0.567623

In [22]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [26]:
# we recommend the optimized pandas data access methods, .at, .iat, .loc and .iloc.

In [27]:
df["A"]

2013-01-01    0.034255
2013-01-02   -1.036620
2013-01-03   -0.748499
2013-01-04    1.101671
2013-01-05    0.144672
2013-01-06    0.567623
Freq: D, Name: A, dtype: float64

In [28]:
df

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [29]:
df[0:4]

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977

In [30]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977

In [31]:
df

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [32]:
df.loc[dates[0]]

A    0.034255
B   -0.649146
C    0.667519
D    0.479030
Name: 2013-01-01 00:00:00, dtype: float64

In [33]:
df.loc[dates[1]]

A   -1.036620
B   -0.547717
C   -0.678809
D   -0.917390
Name: 2013-01-02 00:00:00, dtype: float64

In [34]:
df.loc[:,["A","B"]]

                   A         B
2013-01-01  0.034255 -0.649146
2013-01-02 -1.036620 -0.547717
2013-01-03 -0.748499 -1.162706
2013-01-04  1.101671  0.110106
2013-01-05  0.144672  0.208789
2013-01-06  0.567623  0.742004

In [35]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -1.036620 -0.547717
2013-01-03 -0.748499 -1.162706
2013-01-04  1.101671  0.110106

In [38]:
df.loc["20130102", ["A", "B"]]

A   -1.036620
B   -0.547717
Name: 2013-01-02 00:00:00, dtype: float64

In [39]:
df.loc[dates[0], "A"]

0.034255453689544565

In [40]:
# Faster than above

In [41]:
df.at[dates[0], "A"]

0.034255453689544565

In [42]:
df

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [43]:
df.iloc[3]

A    1.101671
B    0.110106
C   -1.449211
D    0.235977
Name: 2013-01-04 00:00:00, dtype: float64

In [45]:
df.iloc[3:5,0:2]  #5 and 2 doesn't include in the index

                   A         B
2013-01-04  1.101671  0.110106
2013-01-05  0.144672  0.208789

In [46]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.036620 -0.678809
2013-01-03 -0.748499  1.746339
2013-01-05  0.144672 -0.381308

In [47]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239

In [48]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -0.649146  0.667519
2013-01-02 -0.547717 -0.678809
2013-01-03 -1.162706  1.746339
2013-01-04  0.110106 -1.449211
2013-01-05  0.208789 -0.381308
2013-01-06  0.742004  0.075186

In [49]:
df.iat[1, 1]

-0.5477172441288272

In [50]:
df

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390
2013-01-03 -0.748499 -1.162706  1.746339  0.003239
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [51]:
df[df["A"]>0]

                   A         B         C         D
2013-01-01  0.034255 -0.649146  0.667519  0.479030
2013-01-04  1.101671  0.110106 -1.449211  0.235977
2013-01-05  0.144672  0.208789 -0.381308  0.833285
2013-01-06  0.567623  0.742004  0.075186 -1.626853

In [52]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.034255       NaN  0.667519  0.479030
2013-01-02       NaN       NaN       NaN       NaN
2013-01-03       NaN       NaN  1.746339  0.003239
2013-01-04  1.101671  0.110106       NaN  0.235977
2013-01-05  0.144672  0.208789       NaN  0.833285
2013-01-06  0.567623  0.742004  0.075186       NaN

In [53]:
df2 = df.copy()

In [54]:
df2["E"]=["one", "one", "two", "three", "four", "three"]

In [55]:
df2

                   A         B         C         D      E
2013-01-01  0.034255 -0.649146  0.667519  0.479030    one
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390    one
2013-01-03 -0.748499 -1.162706  1.746339  0.003239    two
2013-01-04  1.101671  0.110106 -1.449211  0.235977  three
2013-01-05  0.144672  0.208789 -0.381308  0.833285   four
2013-01-06  0.567623  0.742004  0.075186 -1.626853  three

In [60]:
df2[df2["E"].isin(["two","four"])]

                   A         B         C         D     E
2013-01-03 -0.748499 -1.162706  1.746339  0.003239   two
2013-01-05  0.144672  0.208789 -0.381308  0.833285  four

In [61]:
 s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))

In [62]:
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [63]:
df["F"]=s1

In [64]:
df

                   A         B         C         D    F
2013-01-01  0.034255 -0.649146  0.667519  0.479030  NaN
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390  1.0
2013-01-03 -0.748499 -1.162706  1.746339  0.003239  2.0
2013-01-04  1.101671  0.110106 -1.449211  0.235977  3.0
2013-01-05  0.144672  0.208789 -0.381308  0.833285  4.0
2013-01-06  0.567623  0.742004  0.075186 -1.626853  5.0

In [65]:
df.at[dates[0], "A"] = 0

In [66]:
df

                   A         B         C         D    F
2013-01-01  0.000000 -0.649146  0.667519  0.479030  NaN
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390  1.0
2013-01-03 -0.748499 -1.162706  1.746339  0.003239  2.0
2013-01-04  1.101671  0.110106 -1.449211  0.235977  3.0
2013-01-05  0.144672  0.208789 -0.381308  0.833285  4.0
2013-01-06  0.567623  0.742004  0.075186 -1.626853  5.0

In [67]:
df.iat[0, 1] = 0

In [68]:
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  0.667519  0.479030  NaN
2013-01-02 -1.036620 -0.547717 -0.678809 -0.917390  1.0
2013-01-03 -0.748499 -1.162706  1.746339  0.003239  2.0
2013-01-04  1.101671  0.110106 -1.449211  0.235977  3.0
2013-01-05  0.144672  0.208789 -0.381308  0.833285  4.0
2013-01-06  0.567623  0.742004  0.075186 -1.626853  5.0

In [69]:
df.loc[:, "D"] = np.array([5] * len(df))

In [70]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.667519  5  NaN
2013-01-02 -1.036620 -0.547717 -0.678809  5  1.0
2013-01-03 -0.748499 -1.162706  1.746339  5  2.0
2013-01-04  1.101671  0.110106 -1.449211  5  3.0
2013-01-05  0.144672  0.208789 -0.381308  5  4.0
2013-01-06  0.567623  0.742004  0.075186  5  5.0

In [72]:
len(df)

6

In [73]:
np.array([5]*6)

array([5, 5, 5, 5, 5, 5])

In [74]:
df2 = df.copy()

In [75]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  0.667519  5  NaN
2013-01-02 -1.036620 -0.547717 -0.678809  5  1.0
2013-01-03 -0.748499 -1.162706  1.746339  5  2.0
2013-01-04  1.101671  0.110106 -1.449211  5  3.0
2013-01-05  0.144672  0.208789 -0.381308  5  4.0
2013-01-06  0.567623  0.742004  0.075186  5  5.0

In [76]:
df2[df2>0]

                   A         B         C  D    F
2013-01-01       NaN       NaN  0.667519  5  NaN
2013-01-02       NaN       NaN       NaN  5  1.0
2013-01-03       NaN       NaN  1.746339  5  2.0
2013-01-04  1.101671  0.110106       NaN  5  3.0
2013-01-05  0.144672  0.208789       NaN  5  4.0
2013-01-06  0.567623  0.742004  0.075186  5  5.0

In [77]:
df2[df2>0] = -df2

In [78]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -0.667519 -5  NaN
2013-01-02 -1.036620 -0.547717 -0.678809 -5 -1.0
2013-01-03 -0.748499 -1.162706 -1.746339 -5 -2.0
2013-01-04 -1.101671 -0.110106 -1.449211 -5 -3.0
2013-01-05 -0.144672 -0.208789 -0.381308 -5 -4.0
2013-01-06 -0.567623 -0.742004 -0.075186 -5 -5.0